import React, { useState } from "react";
import "./about.css";
const About = () => {
  const [showFAQ1, setShowFAQ1] = useState(false);
  const [showFAQ2, setShowFAQ2] = useState(false);
  const [showFAQ3, setShowFAQ3] = useState(false);
  const [showFAQ4, setShowFAQ4] = useState(false);
  const [showFAQ5, setShowFAQ5] = useState(false);
  const [showTerms, setShowTerms] = useState(false);
  const [showPrivacy, setShowPrivacy] = useState(false);

  const toggleFAQ1 = () => setShowFAQ1(!showFAQ1);
  const toggleFAQ2 = () => setShowFAQ2(!showFAQ2);
  const toggleFAQ3 = () => setShowFAQ3(!showFAQ3);
  const toggleFAQ4 = () => setShowFAQ4(!showFAQ4);
  const toggleFAQ5 = () => setShowFAQ5(!showFAQ5);
  const toggleTerms = () => setShowTerms(!showTerms);
  const togglePrivacy = () => setShowPrivacy(!showPrivacy);

  return (
    <div className="about_container">
      <h1>Біз туралы</h1>
      <p>Спорт алаңдарын онлайн брондау сайтымызға қош келдіңіз! Мұнда сіз:</p>
      <ul>
        <li>Спорт алаңдарын онлайн брондау</li>
        <li>Біздің чатта жиі қойылатын сұрақтарды қою</li>
        <li>Біздің серіктесіміз болу және қосымша артықшылықтар алу</li>
        <li>Құпиялылық шарттары мен біздің қызметтеріміз туралы білу</li>
        <li>Қызмет көрсету шарттарымен танысу</li>
      </ul>
      <p>
        Біз спорт алаңдарын брондау процесін сіз үшін барынша ыңғайлы және
        жылдам етуге тырысамыз. Біздің платформа қол жетімді алаңдар, олардың
        орналасуы, құны және басқа да шарттар туралы толық ақпарат береді.
      </p>
      <p>
        Біздің команда сіздің тәжірибеңізді одан әрі жақсарту үшін сервисті
        жақсарту және жаңа мүмкіндіктерді қосу үшін үнемі жұмыс істейді. Біз
        сіздің пікіріңізді бағалаймыз және біздің сервисті жақсарту жөніндегі
        ұсыныстар мен тілектерді қарауға әрдайым дайынбыз.{" "}
      </p>
      <p>
        Спорт алаңдарын брондауға арналған платформамызды таңдағаныңыз үшін
        рахмет. Сіздерге біздің қызметтерімізді пайдалану ұнайды деп
        үміттенеміз!{" "}
      </p>

      <h2>Жиі қойылатын сұрақтар</h2>
      <div>
        <button onClick={toggleFAQ1}>
          Спорт алаңын қалай брондай аламын?{" "}
        </button>
        {showFAQ1 && (
          <p>
            Спорт алаңын брондау үшін қажетті алаңды таңдаңыз, күні мен уақытын
            көрсетіңіз және брондауды бірнеше уақыт ішінде аяқтаңыз қадам.
          </p>
        )}
      </div>
      <div>
        <button onClick={toggleFAQ2}>
          Клиенттерге слотты қалай брондауға болады?
        </button>
        {showFAQ2 && (
          <p>
            Слотты брондау үшін тіркелгіңізге кіріңіз, таңдаңыз спорт алаңын
            таңдаңыз, қол жетімді уақытты таңдаңыз және брондау.
          </p>
        )}
      </div>
      <div>
        <button onClick={toggleFAQ3}>
          Қолдау қызметіне қалай хабарласуға болады?{" "}
        </button>
        {showFAQ3 && (
          <p>
            Сіз сайтындағы чат арқылы біздің қолдау қызметіне хабарласа аласыз
            немесе электрондық пошта арқылы{" "}
            <a href="mailto:muratf345@gmail.com">muratf345@gmail.com</a>. Біз
            әрқашан көмектесуге дайынбыз сіз кез келген сұрақтармен.
          </p>
        )}
      </div>
      <div>
        <button onClick={toggleFAQ4}>
          Спорттық нысанды қалай қосуға болады?
        </button>
        {showFAQ4 && (
          <p>
            Спорттық нысанды қосу үшін бізбен хабарласыңыз
            <a href="mailto:muratf345@gmail.com"> muratf345@gmail.com</a>. Біз
            сізге барлық қажетті нұсқауларды ұсынамыз және сіздің нысанды біздің
            сайтқа тіркеуге көмектесеміз.
          </p>
        )}
      </div>
      <div>
        <button onClick={toggleFAQ5}>
          Қандай спорт алаңдарын брондауға болады?{" "}
        </button>
        {showFAQ5 && (
          <p>
            Біз әртүрлі спорт алаңдарын брондауды ұсынамыз, соның ішінде футбол,
            баскетбол, теннис корттары және т.б.
          </p>
        )}
      </div>

      <h2>Серіктес болыңыз</h2>
      <p>
        Біздің серіктестік бағдарламамызға қосылыңыз және айрықша мүмкіндіктер
        мен ресурстар. Біз әрдайым жаңа әріптестерімізге қуаныштымыз және
        сіздерге ынтымақтастық үшін ең жақсы жағдайларды ұсынуға дайынбыз. Білу
        үшін көбірек, бізбен{" "}
        <a href="mailto:muratf345@gmail.com"> muratf345@gmail.com </a>{" "}
        мекенжайына хабарласыңыз.
      </p>

      <h2>Қызмет көрсету шарттары</h2>
      <div>
        <button onClick={toggleTerms}>Толығырақ білу</button>
        {showTerms && (
          <div>
            <p>
              Біздің сайтымызды пайдалану арқылы сіз біздің қызмет көрсету
              шарттарымызбен келісесіз. Біздің қызметтерімізді пайдаланбас бұрын
              олармен танысыңыз. Біз бұл шарттарға кез келген уақытта өзгерістер
              енгізу құқығын сақтаймыз. Негізгі ережелер мыналарды қамтиды:
            </p>
            <ul>
              <li>
                Спорт алаңдарын пайдалану алдында брондау расталуы және төленуі
                тиіс.
              </li>
              <li>
                Брондауды жоспарланған уақытқа 24 сағат қалғанда дейін жою
                мүмкін. Осы мерзімнен кейін брондауды жою кезінде ақшаны қайтару
                қарастырылмайды.
              </li>
              <li>
                Пайдаланушылар спорт алаңдарын пайдалану ережелерін сақтауға
                және мүлікке зиян келтірмеуге міндетті. Ережелерді бұзу біздің
                қызметтерді болашақта пайдалануға тыйым салуға әкелуі мүмкін.
              </li>
              <li>
                Ережелерді бұзу жағдайында біз қызмет көрсетуден бас тарту
                құқығын сақтаймыз. Біз сондай-ақ мүлікке келтірілген кез келген
                зиян үшін өтемақы талап ету құқығын сақтаймыз.
              </li>
            </ul>
            <p>
              Түсіністік пен ынтымақтастық үшін рахмет. Біз барлық
              пайдаланушыларымызға ең жақсы тәжірибені қамтамасыз етуге
              тырысамыз.
            </p>
          </div>
        )}
      </div>

      <h2>Құпиялылық саясаты</h2>
      <div>
        <button onClick={togglePrivacy}>Толығырақ оқу</button>
        {showPrivacy && (
          <div>
            <h3>Терминдер мен анықтамалар</h3>
            <p>
              Әкімшілік – «SpotTandau» , Сайтқа қатысты барлық эксклюзивті
              мүліктік құқықтарға, соның ішінде Сайттың домендік атауына,
              Мобильді қосымшаға және олардың әкімшілігіне құқықтарға ие; Өңдеу
              – жинауды, тіркеуді, ұйымдастыруды, құрылымдауды, сақтауды,
              өңдеуді немесе өзгертуді, іздеуді және таңдауды, сараптаманы қоса
              алғанда, автоматтандырылған құралдарды пайдалана отырып немесе
              пайдаланбай, дербес деректермен немесе дербес деректер жиынтығымен
              орындалатын кез келген операция немесе операциялар жиынтығы. ,
              пайдалану, беру, пошта арқылы жіберу немесе қолжетімді ету,
              топтастыру немесе біріктіру, таңдау, өшіру немесе жоюдың басқа
              тәсілдерімен ашу;
            </p>
            <p>
              Жеке деректер - Пайдаланушыға қатысты немесе оны тікелей немесе
              жанама түрде сәйкестендіруге мүмкіндік беретін кез келген ақпарат,
              атап айтқанда тегі, аты, әкесінің аты (бар болса), электрондық
              пошта, ұялы телефон, фотосуреттер, аты-жөні, жеке сәйкестендіру
              нөмірі, бизнес сәйкестендіру нөмірі, орналасқан жері туралы
              деректер немесе Пайдаланушыны жеке немесе ұжымдық сәйкестендіруге
              мүмкіндік беретін басқа деректер негізінде; Пайдаланушы – Сайтты
              және/немесе Мобильді қосымшаны спорт алаңын жалға алу/жалдау үшін
              пайдаланған және кейіннен жалға алу шартын жасаған кез келген жеке
              немесе заңды тұлға, жеке кәсіпкер;
            </p>
            <p>
              Сайт www.SportTandau.com мекенжайы бойынша Интернетте орналасқан
              интернет-ресурс болып табылады. Сайттың тұжырымдамасы оның
              бағдарламалық қамтамасыз етуін, дизайнын, деректер базасын,
              сондай-ақ оның барлық бөлімдері мен бөлімшелерін қамтиды; Мобильді
              қосымша – спорт алаңдарын іздеу, жалға алу/жалдау, сондай-ақ басқа
              қолданбалы қызметтерді пайдалану мүмкіндігін қамтамасыз ету
              мақсатында смартфондарда, планшеттерде және басқа мобильді
              құрылғыларда жұмыс істеуге арналған бағдарламалық қамтамасыз ету.
            </p>
            <h3>1. Жалпы ережелер</h3>
            <p>
              1.1. Әкімшілік сайтқа кірушілер мен Мобильді қолданба
              пайдаланушыларының құқықтарын, соның ішінде жеке деректерге
              қатысты құпиялылықты сақтау құқықтарын құрметтейді. Сайтты немесе
              мобильді қосымшаны пайдалануды бастамас бұрын, бізге қандай да бір
              Жеке деректерді беруге дайынсыз ба, сондай-ақ жеке деректерді
              өңдеуге келісім беру туралы негізделген шешім қабылдау үшін
              Құпиялылық саясатын мұқият зерделеуіңізді сұраймыз.
            </p>
            <p>
              1.2. Құпиялық саясатында біз толық сипаттайтын боламыз: (a)
              Сайтты, Мобильді қолданбаны пайдаланған кезде қандай Жеке
              деректерді аламыз және жинаймыз; (b) жеке деректерді қалай аламыз;
              (c) жеке деректерді қандай мақсаттарда жинаймыз; (d) Жеке
              деректерді өңдеу кезіндегі құқықтарыңыз; (e) жеке деректерді
              сақтау мерзімдері; (f) Дербес деректер берілуі мүмкін тұлғалар
              санаты; (g) Дербес деректерді өңдеуге берілген келісімді қайтарып
              алу тәртібі.
            </p>
            <p>
              1.3. Осы Құпиялық саясаты Сайт пен Мобильді қосымшаға және
              Пайдаланушы Сайтты және Мобильді қолданбаны пайдаланған кезде
              жиналған жеке деректерге қолданылады. Осы Құпиялық саясатының
              ережелері мыналарға қолданылмайды: (a) біздің сайтқа немесе
              мобильді қосымшаға сілтемелері бар кез келген басқа сайттарға; (b)
              Мобильді қосымшада сайтта сілтемелері орналастырылған кез келген
              басқа сайттарға.
            </p>
            <p>
              1.4. Әкімшілік Дербес деректермен жұмыс істеу кезінде Қазақстан
              Республикасы заңнамасының талаптарын сақтауға міндеттенеді.
            </p>
            <p>
              1.5. Әкімшілік нәсілдік немесе этникалық шығу тегін, саяси
              көзқарастарды, діни немесе философиялық көзқарастарды, кәсіподақ
              мүшелігін, сондай-ақ Пайдаланушылардың генетикалық, биометриялық
              деректерін, денсаулыққа, жыныстық өмірге немесе жыныстық қатынасқа
              қатысты деректерді өңдеуді ашатын Жеке деректерді өңдеуге ниеті
              жоқ. бағдарлау.
            </p>
            <p>
              1.6. Әкімшілік Құпиялылық саясатын мезгіл-мезгіл қайта қарап, оны
              жаңартуы мүмкін. Өзгерістерге қанағаттанғаныңызға көз жеткізу үшін
              осы құжатты мезгіл-мезгіл тексеріп отыруды ұсынамыз, егер
              өзгерістер Әкімшіліктің пікірінше маңызды болса және сіздің
              құқықтарыңызға әсер етсе, біз сізге тіркелу кезінде берілген
              электрондық пошта арқылы қосымша хабарлаймыз. Сайт, мобильді
              қосымша.
            </p>
            <h3>2. Дербес деректерді жинау</h3>
            <p>
              2.1. Пайдаланушы жеке деректерді Әкімшілікке беруге міндетті емес.
              <br />
              2.2. Веб-сайт пен Мобильді қолданба сіз өз еркіңізбен берген жеке
              деректерді ғана жинайды.
              <br />
              2.3. Сайттың, Мобильді қосымшаның мазмұнын қарау кезінде (оларға
              кіру, ақпаратты оқу кезінде), Пайдаланушыны тіркеу талап
              етілмейді. Пайдаланушы Сайтта белсенді болған кезде Сайт тек
              cookie файлдары сияқты файлдар арқылы алынған Жеке деректерге қол
              жеткізе алады. Мұндай деректерді Әкімшілікке бергіңіз келмесе,
              Құпиялық саясатының «Cookie файлдарын пайдалану» бөлімінде
              көрсетілген қадамдарды орындауыңыз керек. Әйтпесе, Сайт бұл
              деректерді көрсетілген файлдар/құралдар арқылы автоматты түрде
              жинайды. Сайт сонымен қатар ____ бағдарламасы арқылы Пайдаланушы
              деректеріне қол жеткізе алады және сақтайды. <br />
              2.4. Дербес деректерді жинау мен өңдеудің құқықтық негіздері жеке
              деректер түріне және деректерді жинаудың нақты контекстіне
              (мақсатына) байланысты. Деректерді жинау мен өңдеудің құқықтық
              негізі мыналар болуы мүмкін: деректер субъектісінің бір немесе
              бірнеше нақты мақсаттар үшін дербес деректерді өңдеуге келісімі;
              шартты орындау үшін өңдеу (Пайдаланушы келісімі); Әкімшіліктің
              немесе үшінші тұлғаның заңды мүдделерін қамтамасыз ету мақсатында
              өңдеу. <br />
              2.5. Әкімшіліктің жеткілікті заңдық негіздерсіз Пайдаланушыларға
              қатысты алынған ақпаратты жинауға және өңдеуге құқығы жоқ,
              сондықтан Әкімшілік ақпаратты тек келесі мақсаттар үшін жинайды
              және өңдейді:
              <br />
              1) Сізге ұсынылатын қызметтерді жекелендіру үшін тегі және аты,
              бар болса, әкесінің аты, аты сияқты ақпаратты жинай аламыз. <br />
              2) Сіздің толық деректеріңіз, оның ішінде тегі мен аты, бар болса
              әкесінің аты, аты, жеке сәйкестендіру нөмірі, бизнес сәйкестендіру
              нөмірі, ұялы телефон нөмірі, электрондық пошта мекенжайы,
              тіркелген/тұрғылықты жері – біз сізді Сайтта тіркеуіміз керек
              және/ немесе Мобильді қосымшаны және кейіннен сізбен жалға беру
              шарттарын жасасу. <br />
              3) Біз сізбен байланысу үшін электрондық пошта мекенжайыңыз бен
              ұялы телефоныңыз сияқты ақпаратты жинаймыз: Сізге Сайттың,
              Мобильді қосымшаның қызметтеріндегі өзгерістер туралы, жалдау
              шартын жасау немесе оны жасасудан бас тарту туралы хабарламалар
              жіберу үшін, сондай-ақ сұрауларыңызға және басқа ақпарат пен
              жарнамалық хабарларға жауаптар жіберу үшін. Электрондық пошта
              мекенжайыңыз бен ұялы телефон нөміріңізсіз біз сізге Сайт пен
              Мобильді қосымшаның барлық ресурстарына толық қол жеткізуді
              қамтамасыз ете алмаймыз. <br />
              2.6. Қалай болғанда да, сіз осы Құпиялық саясатының барлық
              шарттарын оқымайынша және ақпаратты өңдеуге келісіміңізді
              растамайынша (сайтта және мобильді қосымшада) сіздің жеке
              деректеріңізді жинау бізбен жүзеге асырылмайды. Сондай-ақ, сіз
              үшінші тұлғалардың жеке деректерін ұсынсаңыз, Әкімшілік сіз
              осындай тұлғалардың бізге Жеке деректерді беруге келісімін алдыңыз
              деп есептейді және сіз мұндай үшінші тұлғаларды осы құжатпен
              таныстырғансыз және кез келген уақытта аласыз. біздің сұрауымыз
              бойынша мұндай келісімнің және танысудың болуын растайтын уақыт.{" "}
              <br />
              2.7. Егер Әкімшілік ақпаратыңызды жоғарыда көрсетілмеген басқа
              мақсаттарда өңдеуі қажет болса, біз бұл туралы сізге хабарлаймыз
              және мұндай өңдеуге бөлек келісім сұраймыз. 2.8. Жоғарыда
              айтылғандарға қарамастан, егер өңдеу қолданыстағы заңнамаға сәйкес
              қажет болса, Әкімшілік сіздің кез келген жеке деректеріңізді өңдей
              алады.
            </p>
            <h3>3.Пайдаланушы құқықтары</h3>
            <p>
              3.1. Сіздің жеке деректеріңізге қатысты құқықтарыңыз мыналарды
              қамтиды: <br />
              1) Қол жеткізу құқығы - Сіздің сұрауыңыз бойынша Әкімшілік сіздің
              жеке деректеріңізді жинауды және өңдеуді растайды және сізге осы
              Дербес деректердің көшірмесін береді. <br /> 2) Түзету құқығы -
              егер Әкімшілік сіз туралы сақтайтын Жеке деректер дұрыс емес
              немесе толық болмаса, сіз оны түзетуге немесе толықтыруға
              құқығыңыз бар. Сұрауыңызды алғаннан кейін әкімшілік жеке
              деректеріңіздегі дәлсіздіктерді түзету үшін барлық ақылға қонымды
              шараларды қабылдайды. Жеке деректеріңіз үшінші тұлғаларға берілсе,
              Әкімшілік мүмкіндігінше түзетулер туралы хабарлайды. <br /> 3) Жою
              құқығы - Әкімшілік жеке деректеріңізді сіз берген мақсаттар үшін
              қажет болмаған кезде жояды. Сондай-ақ, сіз кез келген уақытта Жеке
              деректеріңізді жоюды сұрай аласыз және егер жою қолданыстағы заңға
              қайшы келмесе, Әкімшілік мұны жасайды. Егер сіздің жеке
              деректеріңіз үшінші тұлғаларға берілсе, Әкімшілік сіздің жеке
              деректеріңізді жою қажеттілігі туралы үшінші тұлғаларды хабардар
              ету үшін барлық ақылға қонымды шараларды қабылдайды. <br />
              4) Келісімді қайтарып алу құқығы – егер Әкімшілік сіздің жеке
              деректеріңізді сіздің келісіміңіз негізінде өңдесе, мұндай
              қайтарып алу қолданыстағы заңнамамен шектелген жағдайларды
              қоспағанда, кез келген уақытта келісіміңізді қайтарып ала аласыз.{" "}
              <br /> 5) Өңдеуді шектеу құқығы - Сіздің өтінішіңіз бойынша
              Әкімшілік белгілі бір жағдайларда сіздің Жеке деректеріңізді
              өңдеуді шектей немесе тоқтата алады, ал өңдеуді шектеу кезінде
              Сайт әкімшілігі тек жеке деректерді сақтауға құқылы. Өңдеуді
              шектеу кезеңінде жеке деректерді кез келген өңдеу тек
              Пайдаланушының келісімі негізінде немесе басқа заңды негіздер
              бойынша жүзеге асырылады. Егер сіздің жеке деректеріңіз үшінші
              тұлғаларға берілсе, Әкімшілік мүмкіндігінше оларға мұндай сұрау
              туралы хабарлайды. <br />
              6) Өңдеуге қарсылық білдіру құқығы - сұрау бойынша Әкімшілік
              сіздің жеке деректеріңізді өңдеуді кез келген уақытта тоқтатады.
              Деректеріңізді тікелей маркетингтік мақсаттарда өңдеген жағдайда,
              сіз кез келген уақытта маркетингтік мақсаттар үшін сізге қатысты
              жеке деректердің осылай өңделуіне қарсылық білдіруге құқығыңыз
              бар. <br />
              7) Тегін ақпаратты алу құқығы - Әкімшілік сіздің сұрауыңыз
              бойынша, сұраулар анық негізделген және шамадан тыс болмаса,
              сіздің жеке деректеріңізді өңдеуге қатысты кез келген ақпаратты
              тегін береді. Ақпарат мұндай сұрау салуды алған күннен бастап жеті
              күнтізбелік күн ішінде беріледі. Бұл мерзім қажет болған жағдайда
              сұраныстардың күрделілігі мен санын ескере отырып, тағы бір айға
              ұзартылуы мүмкін. <br />
              3.2. Жоғарыда аталған құқықтардың кез келгенін пайдаланғыңыз
              келсе, support@oyna.me мекенжайы бойынша бізге хабарласыңыз.
              Әкімшіліктің сұрауыңызды өңдеуіне қанағаттанбасаңыз, жеке
              деректерді қорғау туралы заңнаманың сақталуын қадағалау үшін
              жергілікті билік органына сұрау жібере аласыз.
            </p>
            <h3>4. Ақпаратты пайдалану</h3>
            <p>
              4.1. Пайдаланушылардың жеке деректері осы Саясатта тікелей
              қарастырылған жағдайларды қоспағанда, үшінші тұлғаларға
              берілмейді. <br /> 4.2. Пайдаланушы Әкімшіліктің жеке деректерді
              үшінші тұлғаларға - жалға берушілерге немесе жалға алушыларға,
              Сайттың АТ қолдауына және т.б., осы Құпиялық саясатының «Жеке
              деректерді жинау» бөлімінде көрсетілген мақсаттар үшін ғана беруге
              құқығы бар екендігімен келіседі. мұндай ұйымдардың алынған
              деректердің құпиялылығын қамтамасыз ету бойынша міндеттемелер
              қабылдауына. Мұндай үшінші тараптар сіздің ақпаратыңызды олардың
              орналасқан еліне қарамастан қорғауға міндетті. Біз үшінші
              тұлғаларға Әкімшілікке қажетті қызметті көрсету үшін ғана қажет
              жеке деректердің ең аз мөлшерін беруге тырысамыз.
              <br /> 4.3. Әкімшілік заңға сәйкес, сот тәртібімен, сот процесінде
              және/немесе сіз тұратын елде немесе одан тыс жерде мемлекеттік
              органдардың жария сұраулары немесе сұраулары негізінде жеке
              деректеріңізді ашуды талап етуі мүмкін. Сондай-ақ, мұндай ашу
              құқық қорғау немесе басқа да қоғамдық мүдде мақсаттары үшін қажет
              немесе сәйкес екенін анықтасақ, сіз туралы жеке ақпаратты аша
              аламыз. Сондай-ақ, егер ашу біздің шарттарымызды орындау немесе
              бизнесіміз бен пайдаланушыларымызды қорғау үшін қажет екенін
              анықтасақ, жеке ақпаратты аша аламыз. Сонымен қатар, қайта
              ұйымдастыру, біріктіру немесе сату жағдайында біз жинаған жеке
              ақпараттың кез келгенін немесе барлығын тиісті үшінші тарапқа бере
              аламыз.
            </p>
            <h3>
              5. Cookie файлдарын және басқа ұқсас бағдарламаларды пайдалану
            </h3>
            <p>
              5.1. Әкімшілік сіздің компьютеріңізге cookie файлдарын
              орналастыруы мүмкін. Cookie файлдары сайтқа кірген кезде сізді
              тануға және Сайтты пайдалану кезінде ең жақсы тәжірибеңізді
              теңшеуге мүмкіндік беру үшін веб-шолғыш арқылы компьютердің қатты
              дискісіне тасымалданатын әріптік-сандық идентификаторлар болып
              табылады. Cookie сіздің жеке басыңызды көрсетпейді, бірақ ол
              сіздің компьютеріңізді анықтайды.
              <br /> 5.2. Cookie файлдары сияқты технологияларды Әкімшілік,
              біздің маркетингтік серіктестеріміз, аналитиктер немесе қызмет
              жеткізушілері пайдаланады. Бұл технологиялар трендтерді талдау,
              сайтты, мобильді қосымшаны басқару, Сайттағы немесе Мобильді
              қосымшадағы әрекеттеріңізді бақылау үшін қолданылады, т.б. сіз қай
              беттерге кірдіңіз, не жүктелді, Интернет-провайдердің домендік
              атауы және келушінің елі, сондай-ақ Сайтқа немесе Мобильді
              қосымшаға көшу жүзеге асырылған және одан тыс жерде үшінші тарап
              веб-сайттарының мекенжайлары. Дегенмен, бұл ақпараттың барлығы
              сізге жеке тұлға ретінде қатысты емес. Cookie файлдары электрондық
              пошта мекенжайыңызды немесе сіз туралы жеке ақпаратты жазбайды.
              Біз компаниялардың жоғарыда аталған технологияларды пайдалануы
              туралы есептерді жеке немесе жиынтықта алуымыз мүмкін. Сіз
              құрылғыңызға cookie файлдарын немесе бақылау технологияларын
              орналастыруымызға рұқсат бересіз және келісесіз.
              <br /> 5.3. Сонымен қатар, біз Сайтқа және Мобильді қосымшаға
              енгізген деректеріңіз Сайтқа және Мобильді қосымшаға (сеанстар)
              кірулер арасында сақталуын қамтамасыз ету үшін қажет l_____
              бағдарламасын қолданамыз. <br />
              5.4. Егер cookie файлдарына рұқсат бергіңіз келмесе, оларды
              браузер параметрлері арқылы өшіруге болады. Дегенмен, барлық
              платформалардағы барлық браузерлер бұл функцияны қолдамайтынын
              атап өткіміз келеді. Сонымен қатар, егер сіз cookie файлдарын
              өшірсеңіз, біздің Сайтымыз және бағдарламалық құрал дұрыс жұмыс
              істемеуі мүмкін, бұл Сайттың, Мобильді қосымшаның және
              бағдарламалық қамтамасыз етудің жұмысына теріс әсер етуі немесе
              Сайтқа, Мобильді қосымшаға немесе Бағдарламалық құралға кіруді
              шектеуі мүмкін.
            </p>

            <h3>6.Байланыс ақпараты</h3>
            <p>
              6.1. Бұл Құпиялық саясаты қысқа және түсінікті етіп жасалған және
              Әкімшіліктің жеке деректерді жинауы мен пайдалануының барлық
              аспектілері туралы толық ақпарат бермейді. Алайда, егер қажет
              болса, Әкімшілік кез келген қосымша ақпарат немесе түсініктеме
              беруге дайын. Қосымша ақпарат алу үшін кез келген сұрауларды
              muratf345@gmail.com электрондық поштасына жіберу керек. <br />
              6.2. Төмендегі байланыс ақпаратын пайдаланып сайт әкімшілігіне де
              хабарласуға болады: <br />
              Ұйымның атауы: "SportTandau" <br />
              Мекен-жайы: Астана қаласы, Пушкин көшесі 11 <br />
              Байланыс электрондық поштасы: muratf345@gmail.com <br />
              Байланыс телефоны 8 777 809 03 04
            </p>
          </div>
        )}
      </div>
    </div>
  );
};

export default About;
